xmlcf/DataProcessors/Портфель.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<DataProcessor>
		<Properties>
			<Name>Портфель</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

xmlcf/AccumulationRegisters/АктивыОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>АктивыОстатки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СуммаАктива</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Портфель</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

xmlcf/InformationRegisters/ТекущаяЦенаАктива.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ТекущаяЦенаАктива</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Сумма10</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаВРублях</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Актив</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Активы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xmlcf/DataProcessors/Портфель/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Макет = ОбработкаОбъект.ПолучитьМакет("Макет");
	
	ОблОбщиеИтоги 			= Макет.ПолучитьОбласть("ОблОбщиеИтоги");
	ОблГруппировкаПортфель 	= Макет.ПолучитьОбласть("ОблГруппировкаПортфель");
	ОблГруппировкаВидАктива = Макет.ПолучитьОбласть("ОблГруппировкаВидАктива");
	ОблСтрокаАктив 			= Макет.ПолучитьОбласть("ОблСтрокаАктив");
	ОблСтрокаРазделитель 	= Макет.ПолучитьОбласть("ОблСтрокаРазделитель");
	
	ЭтаФорма.ТабличныйДокумент.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	АктивыОстаткиОстатки.Актив КАК Актив,
		|	АктивыОстаткиОстатки.Актив.Вид КАК АктивВид,
		|	АктивыОстаткиОстатки.Валюта КАК Валюта,
		|	АктивыОстаткиОстатки.Портфель КАК Портфель,
		|	АктивыОстаткиОстатки.СуммаОстаток КАК Сумма,
		|	АктивыОстаткиОстатки.КоличествоОстаток КАК Количество,
		|	ЕСТЬNULL(ТекущаяЦенаАктиваСрезПоследних.Цена, АктивыОстаткиОстатки.СуммаОстаток / АктивыОстаткиОстатки.КоличествоОстаток) КАК ТекущаяЦена,
		|	ТекущаяЦенаАктиваСрезПоследних.Период КАК ТекущаяЦенаПериод,
		|	АктивыОстаткиОстатки.СуммаОстаток / АктивыОстаткиОстатки.КоличествоОстаток КАК СредняяЦенаВПортфеле
		|ИЗ
		|	РегистрНакопления.АктивыОстатки.Остатки(
		|			&Период,
		|			ВЫБОР
		|				КОГДА &Портфель = НЕОПРЕДЕЛЕНО
		|					ТОГДА ИСТИНА
		|				ИНАЧЕ Портфель = &Портфель
		|			КОНЕЦ) КАК АктивыОстаткиОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущаяЦенаАктива.СрезПоследних(&Период, ) КАК ТекущаяЦенаАктиваСрезПоследних
		|		ПО АктивыОстаткиОстатки.Актив = ТекущаяЦенаАктиваСрезПоследних.Актив
		|ИТОГИ
		|	СУММА(Сумма)
		|ПО
		|	ОБЩИЕ,
		|	Портфель,
		|	АктивВид";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Портфель", ?(ЗначениеЗаполнено(Объект.Портфель),Объект.Портфель, Неопределено));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаОбщийИтог = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ВыборкаОбщийИтог.Следующий();		// Общий итог
	
	// Вставить обработку выборки ВыборкаОбщийИтог
	
	ВыборкаПортфель = ВыборкаОбщийИтог.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
	Пока ВыборкаПортфель.Следующий() Цикл
		ОблГруппировкаПортфель.Параметры.Портфель = ВыборкаПортфель.Портфель;
		ЭтаФорма.ТабличныйДокумент.Вывести(ОблГруппировкаПортфель);
	
		ВыборкаАктивВид = ВыборкаПортфель.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
		Пока ВыборкаАктивВид.Следующий() Цикл
			ОблГруппировкаВидАктива.Параметры.ВидАктива = ВыборкаАктивВид.АктивВид;
			ЭтаФорма.ТабличныйДокумент.Вывести(ОблГруппировкаВидАктива);
			
			ВыборкаДетальныеЗаписи = ВыборкаАктивВид.Выбрать();	
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ОблСтрокаАктив.Параметры.ИмяАктива = ВыборкаДетальныеЗаписи.Актив;
				
				ТекущаяСтоимостьВВалютеПриобретения = Строка(ВыборкаДетальныеЗаписи.ТекущаяЦена * ВыборкаДетальныеЗаписи.Количество) + " " + Строка(ВыборкаДетальныеЗаписи.Валюта);
				ОблСтрокаАктив.Параметры.ТекущаяСтоимостьВВалютеПриобретения = ТекущаяСтоимостьВВалютеПриобретения;
				
				КоличествоИСредняя = Строка(ВыборкаДетальныеЗаписи.Количество) + " шт. " + Строка(ВыборкаДетальныеЗаписи.СредняяЦенаВПортфеле) + " " + Строка(ВыборкаДетальныеЗаписи.Валюта);
				ОблСтрокаАктив.Параметры.КоличествоИСредняя = КоличествоИСредняя;
				
				Прирост = "";
				ОблСтрокаАктив.Параметры.Прирост = Прирост;

				ЭтаФорма.ТабличныйДокумент.Вывести(ОблСтрокаАктив);
				ЭтаФорма.ТабличныйДокумент.Вывести(ОблСтрокаРазделитель);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;

КонецПроцедуры
